[
    {
      
      "id": 1,
      "title" : "PHASE 1: DISCOVER",
      "button": "More",
      "content":"IntelOra Resources & Developments (IntelOra) is founded by Mr. J. L. Sharma in 2009 with 5 people. This organization initially started working on its in-house application for business process and Human resource management system (HRMS). The idea about to start the organization is to make the management more customized, user friendly and to make the business processes easy and secure. Later in second quarter of the year organization moved into banking and finance (BFSI) and other application development for its new client from different domain and areas. We also started working on different technologies and still trying to provide more contemporary and modular solutions for their sophisticated and primordial business processes to surpass client expectations consistently."
    },
    {
     
      "id": 2,
      "title" : "PHASE 2: DESIGN AND DEVELOP",
      "button": "More",
      "content":"Innovative Technologies! Our innovative technology and advance services make your business very sharpen in the market and our strong technical strategy improve the performance of your business over the Internet and Media technologies. We believe that only close cooperation with our customers all the way in project development can bring a visible and effective outcome. We are capable to deal with in-depth technical skills and capabilities to provide accurate recommendations and roadmaps on how to make your business transition from legacy to new networks and services. By aligning the potential of new technologies with your company's competitive environment, we enable you to envision new types of services, often uncovering unexpected opportunities."
    },
    {
      
      "id": 3,
      "title" : "PHASE 3: DEPLOY",
      "button": "More",
      "content":"Deployment Kit: Assisting the client with the best deployment and launch strategy, to maximize reach, take-up, impact and longevity. We deliver a proper deployment document to our client for their future reference and manage the application./nSource Code: Source code is the key material for any application for their future enhancement, modification or development. We deliver the source code with proper code training with its architecture./nUser Acceptance: User acceptance is a key process of application delivery. Testing generally involves running a suite of tests on the completed system. User acceptance testing is conducted to determine if the requirements of a specification or contract are met."
     
    }
   
]